Hi-Im-David/zephyr/include/zephyr/dt-bindings/misc/nordic-nrf-ficr-nrf7120.h
/*
 * Copyright (c) 2026 Nordic Semiconductor ASA
 * SPDX-License-Identifier: Apache-2.0
 */

/* autogenerated using Nordic HAL utils/gen_offsets.py script */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_MISC_NORDIC_NRF_FICR_NRF7120_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_MISC_NORDIC_NRF_FICR_NRF7120_H_

#define NRF_FICR_INFO_CONFIGID    0x300U
#define NRF_FICR_INFO_DEVICEID_0  0x304U
#define NRF_FICR_INFO_DEVICEID_1  0x308U
#define NRF_FICR_INFO_UUID_0      0x30CU
#define NRF_FICR_INFO_UUID_1      0x310U
#define NRF_FICR_INFO_UUID_2      0x314U
#define NRF_FICR_INFO_UUID_3      0x318U
#define NRF_FICR_INFO_PART        0x31CU
#define NRF_FICR_INFO_VARIANT     0x320U
#define NRF_FICR_INFO_PACKAGE     0x324U
#define NRF_FICR_INFO_RAM         0x328U
#define NRF_FICR_INFO_MRAM        0x330U
#define NRF_FICR_TRIMCNF_0_ADDR   0x400U
#define NRF_FICR_TRIMCNF_0_DATA   0x404U
#define NRF_FICR_TRIMCNF_1_ADDR   0x408U
#define NRF_FICR_TRIMCNF_1_DATA   0x40CU
#define NRF_FICR_TRIMCNF_2_ADDR   0x410U
#define NRF_FICR_TRIMCNF_2_DATA   0x414U
#define NRF_FICR_TRIMCNF_3_ADDR   0x418U
#define NRF_FICR_TRIMCNF_3_DATA   0x41CU
#define NRF_FICR_TRIMCNF_4_ADDR   0x420U
#define NRF_FICR_TRIMCNF_4_DATA   0x424U
#define NRF_FICR_TRIMCNF_5_ADDR   0x428U
#define NRF_FICR_TRIMCNF_5_DATA   0x42CU
#define NRF_FICR_TRIMCNF_6_ADDR   0x430U
#define NRF_FICR_TRIMCNF_6_DATA   0x434U
#define NRF_FICR_TRIMCNF_7_ADDR   0x438U
#define NRF_FICR_TRIMCNF_7_DATA   0x43CU
#define NRF_FICR_TRIMCNF_8_ADDR   0x440U
#define NRF_FICR_TRIMCNF_8_DATA   0x444U
#define NRF_FICR_TRIMCNF_9_ADDR   0x448U
#define NRF_FICR_TRIMCNF_9_DATA   0x44CU
#define NRF_FICR_TRIMCNF_10_ADDR  0x450U
#define NRF_FICR_TRIMCNF_10_DATA  0x454U
#define NRF_FICR_TRIMCNF_11_ADDR  0x458U
#define NRF_FICR_TRIMCNF_11_DATA  0x45CU
#define NRF_FICR_TRIMCNF_12_ADDR  0x460U
#define NRF_FICR_TRIMCNF_12_DATA  0x464U
#define NRF_FICR_TRIMCNF_13_ADDR  0x468U
#define NRF_FICR_TRIMCNF_13_DATA  0x46CU
#define NRF_FICR_TRIMCNF_14_ADDR  0x470U
#define NRF_FICR_TRIMCNF_14_DATA  0x474U
#define NRF_FICR_TRIMCNF_15_ADDR  0x478U
#define NRF_FICR_TRIMCNF_15_DATA  0x47CU
#define NRF_FICR_TRIMCNF_16_ADDR  0x480U
#define NRF_FICR_TRIMCNF_16_DATA  0x484U
#define NRF_FICR_TRIMCNF_17_ADDR  0x488U
#define NRF_FICR_TRIMCNF_17_DATA  0x48CU
#define NRF_FICR_TRIMCNF_18_ADDR  0x490U
#define NRF_FICR_TRIMCNF_18_DATA  0x494U
#define NRF_FICR_TRIMCNF_19_ADDR  0x498U
#define NRF_FICR_TRIMCNF_19_DATA  0x49CU
#define NRF_FICR_TRIMCNF_20_ADDR  0x4A0U
#define NRF_FICR_TRIMCNF_20_DATA  0x4A4U
#define NRF_FICR_TRIMCNF_21_ADDR  0x4A8U
#define NRF_FICR_TRIMCNF_21_DATA  0x4ACU
#define NRF_FICR_TRIMCNF_22_ADDR  0x4B0U
#define NRF_FICR_TRIMCNF_22_DATA  0x4B4U
#define NRF_FICR_TRIMCNF_23_ADDR  0x4B8U
#define NRF_FICR_TRIMCNF_23_DATA  0x4BCU
#define NRF_FICR_TRIMCNF_24_ADDR  0x4C0U
#define NRF_FICR_TRIMCNF_24_DATA  0x4C4U
#define NRF_FICR_TRIMCNF_25_ADDR  0x4C8U
#define NRF_FICR_TRIMCNF_25_DATA  0x4CCU
#define NRF_FICR_TRIMCNF_26_ADDR  0x4D0U
#define NRF_FICR_TRIMCNF_26_DATA  0x4D4U
#define NRF_FICR_TRIMCNF_27_ADDR  0x4D8U
#define NRF_FICR_TRIMCNF_27_DATA  0x4DCU
#define NRF_FICR_TRIMCNF_28_ADDR  0x4E0U
#define NRF_FICR_TRIMCNF_28_DATA  0x4E4U
#define NRF_FICR_TRIMCNF_29_ADDR  0x4E8U
#define NRF_FICR_TRIMCNF_29_DATA  0x4ECU
#define NRF_FICR_TRIMCNF_30_ADDR  0x4F0U
#define NRF_FICR_TRIMCNF_30_DATA  0x4F4U
#define NRF_FICR_TRIMCNF_31_ADDR  0x4F8U
#define NRF_FICR_TRIMCNF_31_DATA  0x4FCU
#define NRF_FICR_TRIMCNF_32_ADDR  0x500U
#define NRF_FICR_TRIMCNF_32_DATA  0x504U
#define NRF_FICR_TRIMCNF_33_ADDR  0x508U
#define NRF_FICR_TRIMCNF_33_DATA  0x50CU
#define NRF_FICR_TRIMCNF_34_ADDR  0x510U
#define NRF_FICR_TRIMCNF_34_DATA  0x514U
#define NRF_FICR_TRIMCNF_35_ADDR  0x518U
#define NRF_FICR_TRIMCNF_35_DATA  0x51CU
#define NRF_FICR_TRIMCNF_36_ADDR  0x520U
#define NRF_FICR_TRIMCNF_36_DATA  0x524U
#define NRF_FICR_TRIMCNF_37_ADDR  0x528U
#define NRF_FICR_TRIMCNF_37_DATA  0x52CU
#define NRF_FICR_TRIMCNF_38_ADDR  0x530U
#define NRF_FICR_TRIMCNF_38_DATA  0x534U
#define NRF_FICR_TRIMCNF_39_ADDR  0x538U
#define NRF_FICR_TRIMCNF_39_DATA  0x53CU
#define NRF_FICR_TRIMCNF_40_ADDR  0x540U
#define NRF_FICR_TRIMCNF_40_DATA  0x544U
#define NRF_FICR_TRIMCNF_41_ADDR  0x548U
#define NRF_FICR_TRIMCNF_41_DATA  0x54CU
#define NRF_FICR_TRIMCNF_42_ADDR  0x550U
#define NRF_FICR_TRIMCNF_42_DATA  0x554U
#define NRF_FICR_TRIMCNF_43_ADDR  0x558U
#define NRF_FICR_TRIMCNF_43_DATA  0x55CU
#define NRF_FICR_TRIMCNF_44_ADDR  0x560U
#define NRF_FICR_TRIMCNF_44_DATA  0x564U
#define NRF_FICR_TRIMCNF_45_ADDR  0x568U
#define NRF_FICR_TRIMCNF_45_DATA  0x56CU
#define NRF_FICR_TRIMCNF_46_ADDR  0x570U
#define NRF_FICR_TRIMCNF_46_DATA  0x574U
#define NRF_FICR_TRIMCNF_47_ADDR  0x578U
#define NRF_FICR_TRIMCNF_47_DATA  0x57CU
#define NRF_FICR_TRIMCNF_48_ADDR  0x580U
#define NRF_FICR_TRIMCNF_48_DATA  0x584U
#define NRF_FICR_TRIMCNF_49_ADDR  0x588U
#define NRF_FICR_TRIMCNF_49_DATA  0x58CU
#define NRF_FICR_TRIMCNF_50_ADDR  0x590U
#define NRF_FICR_TRIMCNF_50_DATA  0x594U
#define NRF_FICR_TRIMCNF_51_ADDR  0x598U
#define NRF_FICR_TRIMCNF_51_DATA  0x59CU
#define NRF_FICR_TRIMCNF_52_ADDR  0x5A0U
#define NRF_FICR_TRIMCNF_52_DATA  0x5A4U
#define NRF_FICR_TRIMCNF_53_ADDR  0x5A8U
#define NRF_FICR_TRIMCNF_53_DATA  0x5ACU
#define NRF_FICR_TRIMCNF_54_ADDR  0x5B0U
#define NRF_FICR_TRIMCNF_54_DATA  0x5B4U
#define NRF_FICR_TRIMCNF_55_ADDR  0x5B8U
#define NRF_FICR_TRIMCNF_55_DATA  0x5BCU
#define NRF_FICR_TRIMCNF_56_ADDR  0x5C0U
#define NRF_FICR_TRIMCNF_56_DATA  0x5C4U
#define NRF_FICR_TRIMCNF_57_ADDR  0x5C8U
#define NRF_FICR_TRIMCNF_57_DATA  0x5CCU
#define NRF_FICR_TRIMCNF_58_ADDR  0x5D0U
#define NRF_FICR_TRIMCNF_58_DATA  0x5D4U
#define NRF_FICR_TRIMCNF_59_ADDR  0x5D8U
#define NRF_FICR_TRIMCNF_59_DATA  0x5DCU
#define NRF_FICR_TRIMCNF_60_ADDR  0x5E0U
#define NRF_FICR_TRIMCNF_60_DATA  0x5E4U
#define NRF_FICR_TRIMCNF_61_ADDR  0x5E8U
#define NRF_FICR_TRIMCNF_61_DATA  0x5ECU
#define NRF_FICR_TRIMCNF_62_ADDR  0x5F0U
#define NRF_FICR_TRIMCNF_62_DATA  0x5F4U
#define NRF_FICR_TRIMCNF_63_ADDR  0x5F8U
#define NRF_FICR_TRIMCNF_63_DATA  0x5FCU
#define NRF_FICR_TRIMCNF_64_ADDR  0x600U
#define NRF_FICR_TRIMCNF_64_DATA  0x604U
#define NRF_FICR_TRIMCNF_65_ADDR  0x608U
#define NRF_FICR_TRIMCNF_65_DATA  0x60CU
#define NRF_FICR_TRIMCNF_66_ADDR  0x610U
#define NRF_FICR_TRIMCNF_66_DATA  0x614U
#define NRF_FICR_TRIMCNF_67_ADDR  0x618U
#define NRF_FICR_TRIMCNF_67_DATA  0x61CU
#define NRF_FICR_TRIMCNF_68_ADDR  0x620U
#define NRF_FICR_TRIMCNF_68_DATA  0x624U
#define NRF_FICR_TRIMCNF_69_ADDR  0x628U
#define NRF_FICR_TRIMCNF_69_DATA  0x62CU
#define NRF_FICR_TRIMCNF_70_ADDR  0x630U
#define NRF_FICR_TRIMCNF_70_DATA  0x634U
#define NRF_FICR_TRIMCNF_71_ADDR  0x638U
#define NRF_FICR_TRIMCNF_71_DATA  0x63CU
#define NRF_FICR_TRIMCNF_72_ADDR  0x640U
#define NRF_FICR_TRIMCNF_72_DATA  0x644U
#define NRF_FICR_TRIMCNF_73_ADDR  0x648U
#define NRF_FICR_TRIMCNF_73_DATA  0x64CU
#define NRF_FICR_TRIMCNF_74_ADDR  0x650U
#define NRF_FICR_TRIMCNF_74_DATA  0x654U
#define NRF_FICR_TRIMCNF_75_ADDR  0x658U
#define NRF_FICR_TRIMCNF_75_DATA  0x65CU
#define NRF_FICR_TRIMCNF_76_ADDR  0x660U
#define NRF_FICR_TRIMCNF_76_DATA  0x664U
#define NRF_FICR_TRIMCNF_77_ADDR  0x668U
#define NRF_FICR_TRIMCNF_77_DATA  0x66CU
#define NRF_FICR_TRIMCNF_78_ADDR  0x670U
#define NRF_FICR_TRIMCNF_78_DATA  0x674U
#define NRF_FICR_TRIMCNF_79_ADDR  0x678U
#define NRF_FICR_TRIMCNF_79_DATA  0x67CU
#define NRF_FICR_TRIMCNF_80_ADDR  0x680U
#define NRF_FICR_TRIMCNF_80_DATA  0x684U
#define NRF_FICR_TRIMCNF_81_ADDR  0x688U
#define NRF_FICR_TRIMCNF_81_DATA  0x68CU
#define NRF_FICR_TRIMCNF_82_ADDR  0x690U
#define NRF_FICR_TRIMCNF_82_DATA  0x694U
#define NRF_FICR_TRIMCNF_83_ADDR  0x698U
#define NRF_FICR_TRIMCNF_83_DATA  0x69CU
#define NRF_FICR_TRIMCNF_84_ADDR  0x6A0U
#define NRF_FICR_TRIMCNF_84_DATA  0x6A4U
#define NRF_FICR_TRIMCNF_85_ADDR  0x6A8U
#define NRF_FICR_TRIMCNF_85_DATA  0x6ACU
#define NRF_FICR_TRIMCNF_86_ADDR  0x6B0U
#define NRF_FICR_TRIMCNF_86_DATA  0x6B4U
#define NRF_FICR_TRIMCNF_87_ADDR  0x6B8U
#define NRF_FICR_TRIMCNF_87_DATA  0x6BCU
#define NRF_FICR_TRIMCNF_88_ADDR  0x6C0U
#define NRF_FICR_TRIMCNF_88_DATA  0x6C4U
#define NRF_FICR_TRIMCNF_89_ADDR  0x6C8U
#define NRF_FICR_TRIMCNF_89_DATA  0x6CCU
#define NRF_FICR_TRIMCNF_90_ADDR  0x6D0U
#define NRF_FICR_TRIMCNF_90_DATA  0x6D4U
#define NRF_FICR_TRIMCNF_91_ADDR  0x6D8U
#define NRF_FICR_TRIMCNF_91_DATA  0x6DCU
#define NRF_FICR_TRIMCNF_92_ADDR  0x6E0U
#define NRF_FICR_TRIMCNF_92_DATA  0x6E4U
#define NRF_FICR_TRIMCNF_93_ADDR  0x6E8U
#define NRF_FICR_TRIMCNF_93_DATA  0x6ECU
#define NRF_FICR_TRIMCNF_94_ADDR  0x6F0U
#define NRF_FICR_TRIMCNF_94_DATA  0x6F4U
#define NRF_FICR_TRIMCNF_95_ADDR  0x6F8U
#define NRF_FICR_TRIMCNF_95_DATA  0x6FCU
#define NRF_FICR_TRIMCNF_96_ADDR  0x700U
#define NRF_FICR_TRIMCNF_96_DATA  0x704U
#define NRF_FICR_TRIMCNF_97_ADDR  0x708U
#define NRF_FICR_TRIMCNF_97_DATA  0x70CU
#define NRF_FICR_TRIMCNF_98_ADDR  0x710U
#define NRF_FICR_TRIMCNF_98_DATA  0x714U
#define NRF_FICR_TRIMCNF_99_ADDR  0x718U
#define NRF_FICR_TRIMCNF_99_DATA  0x71CU
#define NRF_FICR_TRIMCNF_100_ADDR 0x720U
#define NRF_FICR_TRIMCNF_100_DATA 0x724U
#define NRF_FICR_TRIMCNF_101_ADDR 0x728U
#define NRF_FICR_TRIMCNF_101_DATA 0x72CU
#define NRF_FICR_TRIMCNF_102_ADDR 0x730U
#define NRF_FICR_TRIMCNF_102_DATA 0x734U
#define NRF_FICR_TRIMCNF_103_ADDR 0x738U
#define NRF_FICR_TRIMCNF_103_DATA 0x73CU
#define NRF_FICR_TRIMCNF_104_ADDR 0x740U
#define NRF_FICR_TRIMCNF_104_DATA 0x744U
#define NRF_FICR_TRIMCNF_105_ADDR 0x748U
#define NRF_FICR_TRIMCNF_105_DATA 0x74CU
#define NRF_FICR_TRIMCNF_106_ADDR 0x750U
#define NRF_FICR_TRIMCNF_106_DATA 0x754U
#define NRF_FICR_TRIMCNF_107_ADDR 0x758U
#define NRF_FICR_TRIMCNF_107_DATA 0x75CU
#define NRF_FICR_TRIMCNF_108_ADDR 0x760U
#define NRF_FICR_TRIMCNF_108_DATA 0x764U
#define NRF_FICR_TRIMCNF_109_ADDR 0x768U
#define NRF_FICR_TRIMCNF_109_DATA 0x76CU
#define NRF_FICR_TRIMCNF_110_ADDR 0x770U
#define NRF_FICR_TRIMCNF_110_DATA 0x774U
#define NRF_FICR_TRIMCNF_111_ADDR 0x778U
#define NRF_FICR_TRIMCNF_111_DATA 0x77CU
#define NRF_FICR_TRIMCNF_112_ADDR 0x780U
#define NRF_FICR_TRIMCNF_112_DATA 0x784U
#define NRF_FICR_TRIMCNF_113_ADDR 0x788U
#define NRF_FICR_TRIMCNF_113_DATA 0x78CU
#define NRF_FICR_TRIMCNF_114_ADDR 0x790U
#define NRF_FICR_TRIMCNF_114_DATA 0x794U
#define NRF_FICR_TRIMCNF_115_ADDR 0x798U
#define NRF_FICR_TRIMCNF_115_DATA 0x79CU
#define NRF_FICR_TRIMCNF_116_ADDR 0x7A0U
#define NRF_FICR_TRIMCNF_116_DATA 0x7A4U
#define NRF_FICR_TRIMCNF_117_ADDR 0x7A8U
#define NRF_FICR_TRIMCNF_117_DATA 0x7ACU
#define NRF_FICR_TRIMCNF_118_ADDR 0x7B0U
#define NRF_FICR_TRIMCNF_118_DATA 0x7B4U
#define NRF_FICR_TRIMCNF_119_ADDR 0x7B8U
#define NRF_FICR_TRIMCNF_119_DATA 0x7BCU
#define NRF_FICR_TRIMCNF_120_ADDR 0x7C0U
#define NRF_FICR_TRIMCNF_120_DATA 0x7C4U
#define NRF_FICR_TRIMCNF_121_ADDR 0x7C8U
#define NRF_FICR_TRIMCNF_121_DATA 0x7CCU
#define NRF_FICR_TRIMCNF_122_ADDR 0x7D0U
#define NRF_FICR_TRIMCNF_122_DATA 0x7D4U
#define NRF_FICR_TRIMCNF_123_ADDR 0x7D8U
#define NRF_FICR_TRIMCNF_123_DATA 0x7DCU
#define NRF_FICR_TRIMCNF_124_ADDR 0x7E0U
#define NRF_FICR_TRIMCNF_124_DATA 0x7E4U
#define NRF_FICR_TRIMCNF_125_ADDR 0x7E8U
#define NRF_FICR_TRIMCNF_125_DATA 0x7ECU
#define NRF_FICR_TRIMCNF_126_ADDR 0x7F0U
#define NRF_FICR_TRIMCNF_126_DATA 0x7F4U
#define NRF_FICR_TRIMCNF_127_ADDR 0x7F8U
#define NRF_FICR_TRIMCNF_127_DATA 0x7FCU
#define NRF_FICR_NFC_TAGHEADER0   0x900U
#define NRF_FICR_NFC_TAGHEADER1   0x904U
#define NRF_FICR_NFC_TAGHEADER2   0x908U
#define NRF_FICR_NFC_TAGHEADER3   0x90CU
#define NRF_FICR_ER_0             0x380U
#define NRF_FICR_ER_1             0x384U
#define NRF_FICR_ER_2             0x388U
#define NRF_FICR_ER_3             0x38CU
#define NRF_FICR_IR_0             0x390U
#define NRF_FICR_IR_1             0x394U
#define NRF_FICR_IR_2             0x398U
#define NRF_FICR_IR_3             0x39CU
#define NRF_FICR_DEVICEADDRTYPE   0x3A0U
#define NRF_FICR_DEVICEADDR_0     0x3A4U
#define NRF_FICR_DEVICEADDR_1     0x3A8U

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_MISC_NORDIC_NRF_FICR_NRF7120_H_ */
